成都修茈科技有限公司/MODstore_deploy/perf/results/2026-05-04-local-mock/k6-fhd-load.txt

         /\      Grafana   /鈥锯€?  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   鈥锯€綷 
  /          \   |   (  |  (鈥?  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /loadtest/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 3m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/50 VUs  0m01.0s/3m00.0s

running (0m02.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/50 VUs  0m02.0s/3m00.0s

running (0m03.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 01/50 VUs  0m03.0s/3m00.0s

running (0m04.0s), 02/50 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 02/50 VUs  0m04.0s/3m00.0s

running (0m05.0s), 02/50 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 02/50 VUs  0m05.0s/3m00.0s

running (0m06.0s), 02/50 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 02/50 VUs  0m06.0s/3m00.0s

running (0m07.0s), 03/50 VUs, 3 complete and 0 interrupted iterations
default   [   4% ] 03/50 VUs  0m07.0s/3m00.0s

running (0m08.0s), 03/50 VUs, 3 complete and 0 interrupted iterations
default   [   4% ] 03/50 VUs  0m08.0s/3m00.0s

running (0m09.0s), 03/50 VUs, 3 complete and 0 interrupted iterations
default   [   5% ] 03/50 VUs  0m09.0s/3m00.0s

running (0m10.0s), 03/50 VUs, 6 complete and 0 interrupted iterations
default   [   6% ] 03/50 VUs  0m10.0s/3m00.0s

running (0m11.0s), 04/50 VUs, 6 complete and 0 interrupted iterations
default   [   6% ] 04/50 VUs  0m11.0s/3m00.0s

running (0m12.0s), 04/50 VUs, 6 complete and 0 interrupted iterations
default   [   7% ] 04/50 VUs  0m12.0s/3m00.0s

running (0m13.0s), 04/50 VUs, 9 complete and 0 interrupted iterations
default   [   7% ] 04/50 VUs  0m13.0s/3m00.0s

running (0m14.0s), 05/50 VUs, 10 complete and 0 interrupted iterations
default   [   8% ] 05/50 VUs  0m14.0s/3m00.0s

running (0m15.0s), 05/50 VUs, 10 complete and 0 interrupted iterations
default   [   8% ] 05/50 VUs  0m15.0s/3m00.0s

running (0m16.0s), 05/50 VUs, 13 complete and 0 interrupted iterations
default   [   9% ] 05/50 VUs  0m16.0s/3m00.0s

running (0m17.0s), 06/50 VUs, 15 complete and 0 interrupted iterations
default   [   9% ] 06/50 VUs  0m17.0s/3m00.0s

running (0m18.0s), 06/50 VUs, 15 complete and 0 interrupted iterations
default   [  10% ] 06/50 VUs  0m18.0s/3m00.0s

running (0m19.0s), 06/50 VUs, 18 complete and 0 interrupted iterations
default   [  11% ] 06/50 VUs  0m19.0s/3m00.0s

running (0m20.0s), 06/50 VUs, 21 complete and 0 interrupted iterations
default   [  11% ] 06/50 VUs  0m20.0s/3m00.0s

running (0m21.0s), 07/50 VUs, 21 complete and 0 interrupted iterations
default   [  12% ] 07/50 VUs  0m21.0s/3m00.0s

running (0m22.0s), 07/50 VUs, 24 complete and 0 interrupted iterations
default   [  12% ] 07/50 VUs  0m22.0s/3m00.0s

running (0m23.0s), 07/50 VUs, 27 complete and 0 interrupted iterations
default   [  13% ] 07/50 VUs  0m23.0s/3m00.0s

running (0m24.0s), 08/50 VUs, 28 complete and 0 interrupted iterations
default   [  13% ] 08/50 VUs  0m24.0s/3m00.0s

running (0m25.0s), 08/50 VUs, 31 complete and 0 interrupted iterations
default   [  14% ] 08/50 VUs  0m25.0s/3m00.0s

running (0m26.0s), 08/50 VUs, 34 complete and 0 interrupted iterations
default   [  14% ] 08/50 VUs  0m26.0s/3m00.0s

running (0m27.0s), 09/50 VUs, 36 complete and 0 interrupted iterations
default   [  15% ] 09/50 VUs  0m27.0s/3m00.0s

running (0m28.0s), 09/50 VUs, 39 complete and 0 interrupted iterations
default   [  16% ] 09/50 VUs  0m28.0s/3m00.0s

running (0m29.0s), 09/50 VUs, 42 complete and 0 interrupted iterations
default   [  16% ] 09/50 VUs  0m29.0s/3m00.0s

running (0m30.0s), 09/50 VUs, 45 complete and 0 interrupted iterations
default   [  17% ] 09/50 VUs  0m30.0s/3m00.0s

running (0m31.0s), 10/50 VUs, 48 complete and 0 interrupted iterations
default   [  17% ] 10/50 VUs  0m31.0s/3m00.0s

running (0m32.0s), 11/50 VUs, 51 complete and 0 interrupted iterations
default   [  18% ] 11/50 VUs  0m32.0s/3m00.0s

running (0m33.0s), 11/50 VUs, 54 complete and 0 interrupted iterations
default   [  18% ] 11/50 VUs  0m33.0s/3m00.0s

running (0m34.0s), 12/50 VUs, 58 complete and 0 interrupted iterations
default   [  19% ] 12/50 VUs  0m34.0s/3m00.0s

running (0m35.0s), 13/50 VUs, 62 complete and 0 interrupted iterations
default   [  19% ] 13/50 VUs  0m35.0s/3m00.0s

running (0m36.0s), 13/50 VUs, 65 complete and 0 interrupted iterations
default   [  20% ] 13/50 VUs  0m36.0s/3m00.0s

running (0m37.0s), 14/50 VUs, 69 complete and 0 interrupted iterations
default   [  21% ] 14/50 VUs  0m37.0s/3m00.0s

running (0m38.0s), 15/50 VUs, 75 complete and 0 interrupted iterations
default   [  21% ] 15/50 VUs  0m38.0s/3m00.0s

running (0m39.0s), 15/50 VUs, 78 complete and 0 interrupted iterations
default   [  22% ] 15/50 VUs  0m39.0s/3m00.0s

running (0m40.0s), 16/50 VUs, 83 complete and 0 interrupted iterations
default   [  22% ] 16/50 VUs  0m40.0s/3m00.0s

running (0m41.0s), 17/50 VUs, 90 complete and 0 interrupted iterations
default   [  23% ] 17/50 VUs  0m41.0s/3m00.0s

running (0m42.0s), 17/50 VUs, 93 complete and 0 interrupted iterations
default   [  23% ] 17/50 VUs  0m42.0s/3m00.0s

running (0m43.0s), 18/50 VUs, 99 complete and 0 interrupted iterations
default   [  24% ] 18/50 VUs  0m43.0s/3m00.0s

running (0m44.0s), 19/50 VUs, 106 complete and 0 interrupted iterations
default   [  24% ] 19/50 VUs  0m44.0s/3m00.0s

running (0m45.0s), 19/50 VUs, 110 complete and 0 interrupted iterations
default   [  25% ] 19/50 VUs  0m45.0s/3m00.0s

running (0m46.0s), 20/50 VUs, 117 complete and 0 interrupted iterations
default   [  26% ] 20/50 VUs  0m46.0s/3m00.0s

running (0m47.0s), 21/50 VUs, 125 complete and 0 interrupted iterations
default   [  26% ] 21/50 VUs  0m47.0s/3m00.0s

running (0m48.0s), 21/50 VUs, 129 complete and 0 interrupted iterations
default   [  27% ] 21/50 VUs  0m48.0s/3m00.0s

running (0m49.0s), 22/50 VUs, 137 complete and 0 interrupted iterations
default   [  27% ] 22/50 VUs  0m49.0s/3m00.0s

running (0m50.0s), 23/50 VUs, 146 complete and 0 interrupted iterations
default   [  28% ] 23/50 VUs  0m50.0s/3m00.0s

running (0m51.0s), 23/50 VUs, 150 complete and 0 interrupted iterations
default   [  28% ] 23/50 VUs  0m51.0s/3m00.0s

running (0m52.0s), 24/50 VUs, 159 complete and 0 interrupted iterations
default   [  29% ] 24/50 VUs  0m52.0s/3m00.0s

running (0m53.0s), 25/50 VUs, 169 complete and 0 interrupted iterations
default   [  29% ] 25/50 VUs  0m53.0s/3m00.0s

running (0m54.0s), 25/50 VUs, 173 complete and 0 interrupted iterations
default   [  30% ] 25/50 VUs  0m54.0s/3m00.0s

running (0m55.0s), 26/50 VUs, 183 complete and 0 interrupted iterations
default   [  31% ] 26/50 VUs  0m55.0s/3m00.0s

running (0m56.0s), 27/50 VUs, 194 complete and 0 interrupted iterations
default   [  31% ] 27/50 VUs  0m56.0s/3m00.0s

running (0m57.0s), 27/50 VUs, 197 complete and 0 interrupted iterations
default   [  32% ] 27/50 VUs  0m57.0s/3m00.0s

running (0m58.0s), 28/50 VUs, 209 complete and 0 interrupted iterations
default   [  32% ] 28/50 VUs  0m58.0s/3m00.0s

running (0m59.0s), 29/50 VUs, 221 complete and 0 interrupted iterations
default   [  33% ] 29/50 VUs  0m59.0s/3m00.0s

running (1m00.0s), 29/50 VUs, 224 complete and 0 interrupted iterations
default   [  33% ] 29/50 VUs  1m00.0s/3m00.0s

running (1m01.0s), 30/50 VUs, 236 complete and 0 interrupted iterations
default   [  34% ] 30/50 VUs  1m01.0s/3m00.0s

running (1m02.0s), 31/50 VUs, 247 complete and 0 interrupted iterations
default   [  34% ] 31/50 VUs  1m02.0s/3m00.0s

running (1m03.0s), 31/50 VUs, 250 complete and 0 interrupted iterations
default   [  35% ] 31/50 VUs  1m03.0s/3m00.0s

running (1m04.0s), 32/50 VUs, 259 complete and 0 interrupted iterations
default   [  36% ] 32/50 VUs  1m04.0s/3m00.0s

running (1m05.0s), 33/50 VUs, 272 complete and 0 interrupted iterations
default   [  36% ] 33/50 VUs  1m05.0s/3m00.0s

running (1m06.0s), 33/50 VUs, 275 complete and 0 interrupted iterations
default   [  37% ] 33/50 VUs  1m06.0s/3m00.0s

running (1m07.0s), 34/50 VUs, 285 complete and 0 interrupted iterations
default   [  37% ] 34/50 VUs  1m07.0s/3m00.0s

running (1m08.0s), 35/50 VUs, 299 complete and 0 interrupted iterations
default   [  38% ] 35/50 VUs  1m08.0s/3m00.0s

running (1m09.0s), 35/50 VUs, 302 complete and 0 interrupted iterations
default   [  38% ] 35/50 VUs  1m09.0s/3m00.0s

running (1m10.0s), 36/50 VUs, 314 complete and 0 interrupted iterations
default   [  39% ] 36/50 VUs  1m10.0s/3m00.0s

running (1m11.0s), 37/50 VUs, 330 complete and 0 interrupted iterations
default   [  39% ] 37/50 VUs  1m11.0s/3m00.0s

running (1m12.0s), 37/50 VUs, 333 complete and 0 interrupted iterations
default   [  40% ] 37/50 VUs  1m12.0s/3m00.0s

running (1m13.0s), 38/50 VUs, 344 complete and 0 interrupted iterations
default   [  41% ] 38/50 VUs  1m13.0s/3m00.0s

running (1m14.0s), 39/50 VUs, 355 complete and 0 interrupted iterations
default   [  41% ] 39/50 VUs  1m14.0s/3m00.0s

running (1m15.0s), 39/50 VUs, 358 complete and 0 interrupted iterations
default   [  42% ] 39/50 VUs  1m15.0s/3m00.0s

running (1m16.0s), 40/50 VUs, 364 complete and 0 interrupted iterations
default   [  42% ] 40/50 VUs  1m16.0s/3m00.0s

running (1m17.0s), 41/50 VUs, 369 complete and 0 interrupted iterations
default   [  43% ] 41/50 VUs  1m17.0s/3m00.0s

running (1m18.0s), 41/50 VUs, 372 complete and 0 interrupted iterations
default   [  43% ] 41/50 VUs  1m18.0s/3m00.0s

running (1m19.0s), 42/50 VUs, 378 complete and 0 interrupted iterations
default   [  44% ] 42/50 VUs  1m19.0s/3m00.0s

running (1m20.0s), 43/50 VUs, 384 complete and 0 interrupted iterations
default   [  44% ] 43/50 VUs  1m20.0s/3m00.0s

running (1m21.0s), 43/50 VUs, 387 complete and 0 interrupted iterations
default   [  45% ] 43/50 VUs  1m21.0s/3m00.0s

running (1m22.0s), 44/50 VUs, 393 complete and 0 interrupted iterations
default   [  46% ] 44/50 VUs  1m22.0s/3m00.0s

running (1m23.0s), 45/50 VUs, 399 complete and 0 interrupted iterations
default   [  46% ] 45/50 VUs  1m23.0s/3m00.0s

running (1m24.0s), 45/50 VUs, 400 complete and 0 interrupted iterations
default   [  47% ] 45/50 VUs  1m24.0s/3m00.0s

running (1m25.0s), 46/50 VUs, 405 complete and 0 interrupted iterations
default   [  47% ] 46/50 VUs  1m25.0s/3m00.0s

running (1m26.0s), 47/50 VUs, 408 complete and 0 interrupted iterations
default   [  48% ] 47/50 VUs  1m26.0s/3m00.0s

running (1m27.0s), 47/50 VUs, 409 complete and 0 interrupted iterations
default   [  48% ] 47/50 VUs  1m27.0s/3m00.0s

running (1m28.0s), 48/50 VUs, 410 complete and 0 interrupted iterations
default   [  49% ] 48/50 VUs  1m28.0s/3m00.0s

running (1m29.0s), 49/50 VUs, 412 complete and 0 interrupted iterations
default   [  49% ] 49/50 VUs  1m29.0s/3m00.0s

running (1m30.0s), 49/50 VUs, 413 complete and 0 interrupted iterations
default   [  50% ] 49/50 VUs  1m30.0s/3m00.0s

running (1m31.0s), 50/50 VUs, 413 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  1m31.0s/3m00.0s

running (1m32.0s), 50/50 VUs, 414 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  1m32.0s/3m00.0s

running (1m33.0s), 50/50 VUs, 415 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  1m33.0s/3m00.0s

running (1m34.0s), 50/50 VUs, 416 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  1m34.0s/3m00.0s

running (1m35.0s), 50/50 VUs, 417 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  1m35.0s/3m00.0s

running (1m36.0s), 50/50 VUs, 418 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  1m36.0s/3m00.0s

running (1m37.0s), 50/50 VUs, 419 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  1m37.0s/3m00.0s

running (1m38.0s), 50/50 VUs, 420 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  1m38.0s/3m00.0s

running (1m39.0s), 50/50 VUs, 421 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  1m39.0s/3m00.0s

running (1m40.0s), 50/50 VUs, 422 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  1m40.0s/3m00.0s
time="2026-05-04T07:53:31Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"
time="2026-05-04T07:53:31Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:53:32Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:53:32Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"

running (1m41.0s), 50/50 VUs, 423 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  1m41.0s/3m00.0s
time="2026-05-04T07:53:32Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:53:32Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:53:33Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"

running (1m42.0s), 50/50 VUs, 424 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  1m42.0s/3m00.0s
time="2026-05-04T07:53:33Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"
time="2026-05-04T07:53:33Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"
time="2026-05-04T07:53:34Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"

running (1m43.0s), 50/50 VUs, 428 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  1m43.0s/3m00.0s
time="2026-05-04T07:53:34Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:53:34Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:53:34Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:53:34Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:53:35Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:53:35Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"

running (1m44.0s), 50/50 VUs, 434 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  1m44.0s/3m00.0s
time="2026-05-04T07:53:35Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:53:35Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:53:35Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
[...]
time="2026-05-04T07:53:35Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"
time="2026-05-04T07:53:36Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:53:36Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"

running (1m45.0s), 50/50 VUs, 439 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  1m45.0s/3m00.0s
time="2026-05-04T07:53:36Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:53:36Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:53:37Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"

running (1m46.0s), 50/50 VUs, 449 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  1m46.0s/3m00.0s

running (1m47.0s), 50/50 VUs, 462 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  1m47.0s/3m00.0s

running (1m48.0s), 50/50 VUs, 467 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  1m48.0s/3m00.0s

running (1m49.0s), 50/50 VUs, 478 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  1m49.0s/3m00.0s

running (1m50.0s), 50/50 VUs, 490 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  1m50.0s/3m00.0s
time="2026-05-04T07:53:41Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"

running (1m51.0s), 50/50 VUs, 496 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  1m51.0s/3m00.0s
time="2026-05-04T07:53:42Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:53:42Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:53:42Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:53:43Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"

running (1m52.0s), 50/50 VUs, 508 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  1m52.0s/3m00.0s
time="2026-05-04T07:53:43Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:53:44Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"

running (1m53.0s), 50/50 VUs, 520 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  1m53.0s/3m00.0s
time="2026-05-04T07:53:44Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:53:44Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"
time="2026-05-04T07:53:45Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"

running (1m54.0s), 50/50 VUs, 528 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  1m54.0s/3m00.0s

running (1m55.0s), 50/50 VUs, 543 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  1m55.0s/3m00.0s
time="2026-05-04T07:53:46Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"
time="2026-05-04T07:53:46Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"

running (1m56.0s), 50/50 VUs, 558 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  1m56.0s/3m00.0s
time="2026-05-04T07:53:47Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:53:47Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:53:47Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"
time="2026-05-04T07:53:47Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"

running (1m57.0s), 50/50 VUs, 567 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  1m57.0s/3m00.0s
time="2026-05-04T07:53:48Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:53:48Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:53:48Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"

running (1m58.0s), 50/50 VUs, 586 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  1m58.0s/3m00.0s
time="2026-05-04T07:53:49Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:53:50Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"

running (1m59.0s), 50/50 VUs, 602 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  1m59.0s/3m00.0s

running (2m00.0s), 50/50 VUs, 613 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  2m00.0s/3m00.0s

running (2m01.0s), 50/50 VUs, 634 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  2m01.0s/3m00.0s

running (2m02.0s), 50/50 VUs, 652 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  2m02.0s/3m00.0s

running (2m03.0s), 50/50 VUs, 663 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  2m03.0s/3m00.0s

running (2m04.0s), 50/50 VUs, 677 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  2m04.0s/3m00.0s

running (2m05.0s), 50/50 VUs, 690 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  2m05.0s/3m00.0s

running (2m06.0s), 50/50 VUs, 701 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  2m06.0s/3m00.0s

running (2m07.0s), 50/50 VUs, 715 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  2m07.0s/3m00.0s

running (2m08.0s), 50/50 VUs, 727 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  2m08.0s/3m00.0s

running (2m09.0s), 50/50 VUs, 738 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  2m09.0s/3m00.0s

running (2m10.0s), 50/50 VUs, 753 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  2m10.0s/3m00.0s

running (2m11.0s), 50/50 VUs, 763 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  2m11.0s/3m00.0s

running (2m12.0s), 50/50 VUs, 773 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  2m12.0s/3m00.0s

running (2m13.0s), 50/50 VUs, 784 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  2m13.0s/3m00.0s

running (2m14.0s), 50/50 VUs, 789 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  2m14.0s/3m00.0s

running (2m15.0s), 50/50 VUs, 794 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  2m15.0s/3m00.0s

running (2m16.0s), 50/50 VUs, 798 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  2m16.0s/3m00.0s

running (2m17.0s), 50/50 VUs, 801 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  2m17.0s/3m00.0s

running (2m18.0s), 50/50 VUs, 804 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  2m18.0s/3m00.0s

running (2m19.0s), 50/50 VUs, 804 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  2m19.0s/3m00.0s

running (2m20.0s), 50/50 VUs, 806 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  2m20.0s/3m00.0s

running (2m21.0s), 50/50 VUs, 807 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  2m21.0s/3m00.0s

running (2m22.0s), 50/50 VUs, 807 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  2m22.0s/3m00.0s

running (2m23.0s), 50/50 VUs, 808 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  2m23.0s/3m00.0s

running (2m24.0s), 50/50 VUs, 809 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  2m24.0s/3m00.0s

running (2m25.0s), 50/50 VUs, 809 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  2m25.0s/3m00.0s

running (2m26.0s), 50/50 VUs, 809 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  2m26.0s/3m00.0s

running (2m27.0s), 50/50 VUs, 810 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  2m27.0s/3m00.0s

running (2m28.0s), 50/50 VUs, 810 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  2m28.0s/3m00.0s

running (2m29.0s), 50/50 VUs, 810 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  2m29.0s/3m00.0s

running (2m30.0s), 50/50 VUs, 811 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  2m30.0s/3m00.0s

running (2m31.0s), 50/50 VUs, 811 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  2m31.0s/3m00.0s
time="2026-05-04T07:54:23Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:54:23Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:54:23Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"

running (2m32.0s), 50/50 VUs, 811 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  2m32.0s/3m00.0s
time="2026-05-04T07:54:23Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:54:23Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:54:23Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:54:23Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
[...]
time="2026-05-04T07:54:23Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"
time="2026-05-04T07:54:24Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"

running (2m33.0s), 50/50 VUs, 812 complete and 0 interrupted iterations
default   [  85% ] 50/50 VUs  2m33.0s/3m00.0s

running (2m34.0s), 50/50 VUs, 817 complete and 0 interrupted iterations
default   [  86% ] 50/50 VUs  2m34.0s/3m00.0s

running (2m35.0s), 50/50 VUs, 821 complete and 0 interrupted iterations
default   [  86% ] 50/50 VUs  2m35.0s/3m00.0s

running (2m36.0s), 50/50 VUs, 822 complete and 0 interrupted iterations
default   [  87% ] 50/50 VUs  2m36.0s/3m00.0s

running (2m37.0s), 50/50 VUs, 827 complete and 0 interrupted iterations
default   [  87% ] 50/50 VUs  2m37.0s/3m00.0s

running (2m38.0s), 49/50 VUs, 831 complete and 0 interrupted iterations
default   [  88% ] 49/50 VUs  2m38.0s/3m00.0s

running (2m39.0s), 49/50 VUs, 832 complete and 0 interrupted iterations
default   [  88% ] 49/50 VUs  2m39.0s/3m00.0s

running (2m40.0s), 48/50 VUs, 837 complete and 0 interrupted iterations
default   [  89% ] 48/50 VUs  2m40.0s/3m00.0s
time="2026-05-04T07:54:31Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:54:31Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:54:31Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:54:32Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:54:32Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"
time="2026-05-04T07:54:32Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:54:32Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"
time="2026-05-04T07:54:32Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"

running (2m41.0s), 48/50 VUs, 839 complete and 0 interrupted iterations
default   [  89% ] 48/50 VUs  2m41.0s/3m00.0s
time="2026-05-04T07:54:32Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:54:32Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:54:32Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:54:32Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"

running (2m42.0s), 48/50 VUs, 844 complete and 0 interrupted iterations
default   [  90% ] 48/50 VUs  2m42.0s/3m00.0s
time="2026-05-04T07:54:33Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:54:33Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:54:33Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"
time="2026-05-04T07:54:33Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:54:33Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"

running (2m43.0s), 45/50 VUs, 852 complete and 0 interrupted iterations
default   [  91% ] 45/50 VUs  2m43.0s/3m00.0s
time="2026-05-04T07:54:34Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:54:34Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"
time="2026-05-04T07:54:34Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:54:34Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"
time="2026-05-04T07:54:34Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"
time="2026-05-04T07:54:35Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:54:35Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"

running (2m44.0s), 42/50 VUs, 857 complete and 0 interrupted iterations
default   [  91% ] 42/50 VUs  2m44.0s/3m00.0s
time="2026-05-04T07:54:35Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:54:36Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"

running (2m45.0s), 41/50 VUs, 869 complete and 0 interrupted iterations
default   [  92% ] 41/50 VUs  2m45.0s/3m00.0s
time="2026-05-04T07:54:36Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"
time="2026-05-04T07:54:36Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:54:36Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/mod-store/catalog\": dial: i/o timeout"
time="2026-05-04T07:54:36Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"

running (2m46.0s), 37/50 VUs, 881 complete and 0 interrupted iterations
default   [  92% ] 37/50 VUs  2m46.0s/3m00.0s

running (2m47.0s), 35/50 VUs, 885 complete and 0 interrupted iterations
default   [  93% ] 35/50 VUs  2m47.0s/3m00.0s
time="2026-05-04T07:54:38Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:54:38Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:54:38Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"
time="2026-05-04T07:54:38Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"

running (2m48.0s), 33/50 VUs, 897 complete and 0 interrupted iterations
default   [  93% ] 33/50 VUs  2m48.0s/3m00.0s
time="2026-05-04T07:54:40Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"

running (2m49.0s), 29/50 VUs, 910 complete and 0 interrupted iterations
default   [  94% ] 29/50 VUs  2m49.0s/3m00.0s

running (2m50.0s), 28/50 VUs, 913 complete and 0 interrupted iterations
default   [  94% ] 28/50 VUs  2m50.0s/3m00.0s
time="2026-05-04T07:54:42Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"

running (2m51.0s), 26/50 VUs, 925 complete and 0 interrupted iterations
default   [  95% ] 26/50 VUs  2m51.0s/3m00.0s
time="2026-05-04T07:54:43Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"

running (2m52.0s), 24/50 VUs, 934 complete and 0 interrupted iterations
default   [  96% ] 24/50 VUs  2m52.0s/3m00.0s
time="2026-05-04T07:54:43Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"

running (2m53.0s), 23/50 VUs, 937 complete and 0 interrupted iterations
default   [  96% ] 23/50 VUs  2m53.0s/3m00.0s

running (2m54.0s), 20/50 VUs, 948 complete and 0 interrupted iterations
default   [  97% ] 20/50 VUs  2m54.0s/3m00.0s

running (2m55.0s), 20/50 VUs, 954 complete and 0 interrupted iterations
default   [  97% ] 20/50 VUs  2m55.0s/3m00.0s

running (2m56.0s), 20/50 VUs, 958 complete and 0 interrupted iterations
default   [  98% ] 20/50 VUs  2m56.0s/3m00.0s

running (2m57.0s), 17/50 VUs, 966 complete and 0 interrupted iterations
default   [  98% ] 17/50 VUs  2m57.0s/3m00.0s

running (2m58.0s), 15/50 VUs, 972 complete and 0 interrupted iterations
default   [  99% ] 15/50 VUs  2m58.0s/3m00.0s

running (2m59.0s), 15/50 VUs, 976 complete and 0 interrupted iterations
default   [  99% ] 15/50 VUs  2m59.0s/3m00.0s

running (3m00.0s), 13/50 VUs, 981 complete and 0 interrupted iterations
default   [ 100% ] 13/50 VUs  3m00.0s/3m00.0s

running (3m01.0s), 09/50 VUs, 985 complete and 0 interrupted iterations
default 鈫?[ 100% ] 13/50 VUs  3m0s

running (3m02.0s), 05/50 VUs, 989 complete and 0 interrupted iterations
default 鈫?[ 100% ] 13/50 VUs  3m0s
time="2026-05-04T07:54:53Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/api/health\": dial: i/o timeout"
time="2026-05-04T07:54:54Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:18000/health/liveness\": dial: i/o timeout"

running (3m03.0s), 02/50 VUs, 992 complete and 0 interrupted iterations
default 鈫?[ 100% ] 13/50 VUs  3m0s

running (3m04.0s), 01/50 VUs, 993 complete and 0 interrupted iterations
default 鈫?[ 100% ] 13/50 VUs  3m0s

running (3m05.0s), 01/50 VUs, 993 complete and 0 interrupted iterations
default 鈫?[ 100% ] 13/50 VUs  3m0s

     鉁?health status is 200
      鈫? 96% 鈥?鉁?960 / 鉁?34
     鉁?mod-store catalog is 200
      鈫? 97% 鈥?鉁?969 / 鉁?25
     鉁?liveness is 200
      鈫? 96% 鈥?鉁?955 / 鉁?39

     api_duration...................: avg=7.335245 min=0      med=7.352398 max=22.182889 p(90)=8.237958 p(95)=8.639762
     checks.........................: 96.71% 2884 out of 2982
     data_received..................: 593 kB 3.2 kB/s
     data_sent......................: 310 kB 1.7 kB/s
   鉁?error_rate.....................: 3.28%  98 out of 2982
     http_req_blocked...............: avg=30.63ms  min=0s     med=2.87ms   max=19.54s    p(90)=4.12ms   p(95)=4.79ms  
     http_req_connecting............: avg=30.51ms  min=0s     med=2.75ms   max=19.54s    p(90)=3.96ms   p(95)=4.56ms  
   鉁?http_req_duration..............: avg=7.33ms   min=0s     med=7.35ms   max=22.18ms   p(90)=8.23ms   p(95)=8.63ms  
       { expected_response:true }...: avg=7.58ms   min=6.13ms med=7.37ms   max=22.18ms   p(90)=8.25ms   p(95)=8.66ms  
     http_req_failed................: 3.28%  98 out of 2982
     http_req_receiving.............: avg=223.08碌s min=0s     med=178.69碌s max=13.27ms   p(90)=318.4碌s  p(95)=376.13碌s
     http_req_sending...............: avg=102.55碌s min=0s     med=92.91碌s  max=857.59碌s  p(90)=171.64碌s p(95)=207.81碌s
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s       max=0s        p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=7ms      min=0s     med=7.06ms   max=21.68ms   p(90)=7.83ms   p(95)=8.16ms  
     http_reqs......................: 2982   16.101255/s
     iteration_duration.............: avg=6.07s    min=3.02s  med=3.03s    max=1m3s      p(90)=13.14s   p(95)=33.02s  
     iterations.....................: 994    5.367085/s
     vus............................: 1      min=1            max=50
     vus_max........................: 50     min=50           max=50


running (3m05.2s), 00/50 VUs, 994 complete and 0 interrupted iterations
default 鉁?[ 100% ] 00/50 VUs  3m0s